[
    {
        "id":"familiar_shadow",
        "name":"A Familiar Shadow",
        "stages":[
            {
                "progress":10,
                "logText":"In Undertell, I found an ominous stone etched with strange symbols. As I touched I touched its glowing mark, an unnatural chill ran through me, and I heard a voice in my mind, calling out for help. It spoke of torment and told me to return to Crossglen to find answers."
            },
            {
                "progress":20,
                "logText":"The presence of the mark grows unbearable. I feel an overwhelming pull to return to Crossglen. There is something wrong, and I sense it's tied to my father. I must hurry to see what's happening."
            },
            {
                "progress":30,
                "logText":"I spoke to father. He assured me he's fine, but mentioned Leta hasn't been herself lately. She's been pacing her home and muttering to herself. I should check on her and see what's going on."
            },
            {
                "progress":40,
                "logText":"When I confronted Leta, she seemed different--angrier, more agitated. As I pressed her, a dark spirit suddenly manifested before me and attacked. I defeated it, but it didn't feel like the end. I need to return to Undertell and find out what this spirit truly is."
            },
            {
                "progress":50,
                "logText":"I defeated the Dark spirit, but it didn't feel like the end. The Dark spirit trapped inside Leta has fled back to Undertell, where its power seems to grow stronger. I need to return there and finish what I started."
            },
            {
                "progress":60,
                "logText":"In the depths of Undertell, I found the dark spirit waiting for me. It was stronger this time, but I defeated it once and for all. Whatever bond it had with me--and Leta--is broken."
            },
            {
                "progress":70,
                "logText":"I returned to Crossglen to find everything changed. Leta has aged decades in an instant. Her child is now fully grown, and her timid husband, Oromir, seems like a different man entirely. They remember nothing of what happened. The spirit may be gone, but its curse has left a permanent mark on the lives it touched."
            }
        ]
    },
    {
        "id":"galmore_nondisplayed",
        "name":"galmore_nondisplayed",
        "showInLog":1,
        "stages":[
            {
                "progress":1,
                "logText":"level 1 warning - marked stone"
            },
            {
                "progress":2,
                "logText":"level 2 warning - marked stone"
            }
        ]
    }
]